lvx/base/Tasks/бит_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>бит_Задача</Name>
			<Addressing>InformationRegister.бит_ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>Document.бит_ФормаВводаБюджета</xr:Item>
				<xr:Item>Document.бит_БюджетнаяОперация</xr:Item>
				<xr:Item>Document.бит_КорректировкаБюджета</xr:Item>
				<xr:Item>Document.бит_АктуализацияБюджета</xr:Item>
				<xr:Item>Document.бит_РаспределениеБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗависимыхОборотов</xr:Item>
				<xr:Item>Document.бит_УстановкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_КорректировкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_ПолучениеФактическихДанных</xr:Item>
				<xr:Item>Document.бит_ОперацияБюджетирование</xr:Item>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
				<xr:Item>Catalog.бит_СтатьиОборотов</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.бит_НастройкиФормВводаБюджета</xr:Item>
				<xr:Item>Catalog.бит_НастройкиРаспределенияБюджета</xr:Item>
				<xr:Item>Catalog.бит_ЭлементыДанных</xr:Item>
				<xr:Item>Catalog.Подразделения</xr:Item>
				<xr:Item>Document.бит_ДополнительныеУсловияПоДоговору</xr:Item>
				<xr:Item>Document.бит_УстановкаНеснижаемыхОстатков</xr:Item>
				<xr:Item>Document.бит_СведенияОбОстаткахДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Catalog.СценарииПланирования</xr:Item>
				<xr:Item>Document.бит_ПротоколРасхожденийБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗначенийПроизвольныхПараметров</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыВажностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Comment>Дата принятия к исполнению</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Comment>Дата начала исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИсполнения</Name>
					<Comment>Дата окончания исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Результат выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПредыдущее</Name>
					<Comment>Состояние предыдущее</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Comment>Задача основание</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодчиненный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Comment>Точка алгоритма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроверочнаяЗадача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаПроверку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принято</Name>
							<Comment>Принято</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Comment>Роль исполнителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Comment>Объект адресации № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Comment>Объект адресации № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Comment>Объект адресации № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

lvx/base/Tasks/бит_Задача/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());		
	
	МетаданныеОбъекта = Метаданные.Задачи.бит_Задача;
	
	// Добавление кнопки "Раскрасить по статусам"
	// Также добавляются процедуры: К-РаскраситьПоСтатусам(), С-ОформитьСписокДокументовПоСтатусам().
	бит_РаботаСДиалогамиСервер.ДобавитьКнопкуРаскраситьПоСтатусам(Элементы, Команды, КоманднаяПанель,
																  МетаданныеОбъекта);
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи", ПараметрыФормы, ЭтотОбъект, Истина);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура назначается динамически действию кнопки командной панели 
// КоманднаяПанель.РаскраситьПоСтатусам
// (обработчик события "Нажатие" кнопки "РаскраситьПоСтатусам").
// 
&НаКлиенте
Процедура Подключаемый_РаскраситьПоСтатусам()
	
	Элементы.РаскраситьПоСтатусам.Пометка = Не Элементы.РаскраситьПоСтатусам.Пометка;
	ОформитьСписокДокументовПоСтатусам(Элементы.РаскраситьПоСтатусам.Пометка);	
		
КонецПроцедуры // Подключаемый_РаскраситьПоСтатусам()

&НаКлиенте
Процедура КомандаЗадачаНаОсновании(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;				
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗадачаОснование", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("Задача.бит_Задача.Форма.ФормаСозданияЗадачи",ПараметрыФормы, ЭтотОбъект,,,,,РежимОкна);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьИсториюИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Задача", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.Форма.ФормаИсторияСостоянийЗадач",ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет оформление списка документов по статусам.
// 
// Параметры:
//  ТолькоОчистить - Булево 
// 
&НаСервере
Процедура ОформитьСписокДокументовПоСтатусам(Знач ПометкаКн, Знач ЭтоОткрытие = Ложь)

	Если ЭтоОткрытие И НЕ ПометкаКн Тогда
		Возврат;	
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());		
	
	МетаданныеОбъекта = Метаданные.Задачи.бит_Задача;
	
	ОбъектыНаОбработку = ?(ПометкаКн, бит_РаботаСДиалогамиСервер.ПолучитьМассивОбъектов(МетаданныеОбъекта), Новый Массив);
	бит_РаботаСДиалогамиСервер.ОформитьСписокДокументовПоСтатусам(ОбъектыНаОбработку, ПометкаКн, УсловноеОформление, "Список", "Состояние");
	
	Если НЕ ЭтоОткрытие Тогда
		// Сохранение значения пометки.
		РегистрыСведений.бит_СохраненныеЗначения.СохранитьЗнч(Пользователи.ТекущийПользователь(),
			МетаданныеОбъекта, "РаскраситьПоСтатусам_Пометка", ПометкаКн);
	КонецЕсли;
															
КонецПроцедуры

#КонецОбласти
